# Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

print("Введите общее количество журавликов: ")
s = int(input ())
if (s%6 == 0) and (s>0):
    boys = int(s/3/2)
    print(f'Сережа и Петя сделали по {boys} журавликов')
    kate = int(s/3*2)
    print(f'Катя сделала {kate} журавликов')
else:
    print('Задача не имеет решения')