# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;B, C, M, P – 3 очка;F, H, V, W, Y – 4 очка;K – 5 очков;
# J, X – 8 очков;Q, Z – 10 очков.А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;Д, К, Л, М, П, У – 2 очка;Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;Ж, З, Х, Ц, Ч – 5 очков;Ш, Э, Ю – 8 очков;Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.
# Пример
# ноутбук
# 12

one = frozenset({"A", "E", "I", "O","U", "L","N", "S", "T", "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"})
two = frozenset ({"D", "G", "Д", "К", "Л", "М", "П", "У"})
tree = frozenset({"B", "C", "M","P", "Б", "Г", "Ё", "Ь", "Я"})
four = frozenset({"F","H", "V", "W", "Y", "Й", "Ы"})
five = frozenset({"K", "Ж", "З", "Х", "Ц", "Ч"})
eight = frozenset({"J", "X", "Ш", "Э", "Ю"})
ten = frozenset({"Q", "Z","Ф", "Щ", "Ъ"})
my_dic ={one:1, two:2, tree:3, four:4, five:5, eight:8, ten:10}
print("Ввведите слово:")
word = list(input())
count = 0
for i in word:
    for key,value in my_dic.items():
        if i.upper() in key:
            count+= value
            break
print(count)